### 메모리 분류

| 분류 | 특징 |
| --- | --- |
| Stack | 자동변수이고 지역변수인 변수가 사용하는 메모리 영역이며, 임시 메모리의 성격을 가진다. 크기가 작고(기본 설정을 기준으로 최대 1MB 수준) 관리(할당 및 반환)가 자동으로 이루어지는 장점이 있다. |
| Heap | 동적 할당할 수 있는 자유 메모리 영역이며, 개발자 자신 스스로 직접 관리(수동)해야 한다. 32비트 응용프로그램의 경우, 대략 1.xGB 정도를 사용할 수 있다. 따라서 대량의 메모리가 필요하거나 필요한 메모리의 크기를 미리 알 수 없을 때 사용한다. |
| PE image(실행파일) | Text section | C 언어의 소스코드가 번역된 기계어가 저장된 메모리 영역이며, 기본적으로는 읽기전용 메모리이다. 만일 어떤 식으로든 이 영역의 메모리를 변조한다면, 해킹이라 할 수 있다. |
| PE image(실행파일) | Data section | Read only | 상수 형태로 기술하는 문자열(예: "Hello")이 저장된 메모리 영역이며, Text 영역처럼 읽기는 가능하나 쓰기는 허용되지 않는다. |
| PE image(실행파일) | Data section | Read/Write | 정적변수나 전역변수들이 사용하는 메모리 영역이며, 별도로 초기화하지 않아도 0으로 초기화된다. 관리는 자동이라서 힙 영역 메모리처럼 할당 및 해제를 신경 쓸 필요는 없다. |
- PE Header 혹은 PE image로 검색하면 더 자세한 내용을 볼 수 있다.

---
